[
    {
        "quote": "The best revenge is to improve yourself.",
        "author": "Ali ibn Abi Talib",
        "explanation": "Instead of seeking to harm those who hurt you or holding onto resentment, focus your energy on bettering yourself - your character, your actions, your faith. Self-improvement becomes the most dignified response."
    },
    {
        "quote": "Do for this life as if you live forever, do for the afterlife as if you will die tomorrow.",
        "author": "Ali ibn Abi Talib",
        "explanation": "Live with the perspective of both worlds: plan productively for your earthly life, but act with urgency and sincerity toward the next life. Balance worldly preparation with spiritual readiness."
    },
    {
        "quote": "Never explain yourself to anyone, because the one who likes you would not need it, and the one who dislikes you wouldn’t believe it.",
        "author": "Ali ibn Abi Talib",
        "explanation": "Some people will accept you, some won’t - your inner peace doesn’t depend on convincing everyone. Focus on sincerity, not on defending yourself to those unwilling to understand."
    },
    {
        "quote": "Your task is not to seek for love, but merely to seek and find all the barriers within yourself that you have built against it.",
        "author": "Rumi",
        "explanation": "The greatest barrier to love (and Divine love) is internal - our fear, past wounds, hidden doubts. The work is inward: uncover and remove those obstacles so love can flow freely."
    },
    {
        "quote": "You are not a drop in the ocean. You are the ocean in a drop.",
        "author": "Rumi",
        "explanation": "Within you resides vastness - not a tiny part, but the whole in miniature. Recognizing your intrinsic worth and connection to the Divine transforms how you live and respond."
    },
    {
        "quote": "Life is a balance between holding on and letting go.",
        "author": "Rumi",
        "explanation": "Some things to hold onto (faith, values, purpose), others to release (fear, regret, attachments). Wisdom lies in sensing which is which - so you neither cling to what harms nor abandon what nourishes."
    },
    {
        "quote": "The disease of the heart is worse than the disease of the body.",
        "author": "Ali ibn Abi Talib",
        "explanation": "Physical ailments hurt, but spiritual or moral decay is deeper. Attending to the soul - purifying intentions, aligning values - is more urgent than mere bodily health."
    },
    {
        "quote": "A moment of patience in a moment of anger prevents a thousand moments of regret.",
        "author": "Ali ibn Abi Talib",
        "explanation": "In the heat of anger we often say or do things we regret. A single pause, a bit of restraint, can save countless future sorrows. Patience is the guardrail of wisdom."
    },
    {
        "quote": "Stop acting so small. You are the universe in ecstatic motion.",
        "author": "Rumi",
        "explanation": "Don’t shrink yourself by limiting belief or fear. You’re more than you think - allow yourself to expand, to reflect the greatness you carry inwardly."
    },
    {
        "quote": "No wealth like education and no poverty like ignorance.",
        "author": "Ali ibn Abi Talib",
        "explanation": "True wealth is knowledge and insight; true poverty is lack of awareness. Invest in yourself, your understanding, your moral compass - they are assets that endure."
    }
]
