
//
//  HazratUmer.swift
//  Deen Buddy Advanced
//
//  Created by Rana Shaheryar on 10/28/25.
//

[
  {
    "title": "The Day of His Conversion",
    "subtitle": "From the Sword Against Islam to the Sword of Islam",
    "intro": "Before Islam, Umar (RA) was among its fiercest opponents. A confrontation with his sister’s steadfast faith and verses from Surah Taha transformed that hostility into conviction, and his Islam became a turning point for the entire Ummah.",
    "sections": [
      {
        "isBullets": false,
        "heading": "The Enemy of Islam",
        "paragraphs": [
          "Umar ibn al-Khattab (RA) strongly opposed Islam in Makkah, defending ancestral idols and persecuting Muslims.",
          "At the peak of anger, he set out with his sword, declaring his intention to kill the Prophet ﷺ."
        ]
      },
      {
        "isBullets": false,
        "heading": "A Shocking Revelation",
        "paragraphs": [
          "Stopped on the way, Umar (RA) learned that his sister Fatimah (RA) and her husband had embraced Islam.",
          "He turned toward their home in fury."
        ]
      },
      {
        "isBullets": false,
        "heading": "The Qur’an in His Sister’s House",
        "paragraphs": [
          "Inside, they were reciting from Surah Taha. After a confrontation in which his sister was struck, her unwavering courage softened his anger.",
          "He asked to see what they were reciting."
        ]
      },
      {
        "isBullets": false,
        "heading": "The Power of the Qur’an",
        "paragraphs": [
          "After washing, he read the opening of Surah Taha, verses describing the mercy and majesty of Allah.",
          "The words pierced his heart and replaced rage with awe."
        ]
      },
      {
        "isBullets": false,
        "heading": "Embracing Islam",
        "paragraphs": [
          "Umar (RA) went to the gathering of the Prophet ﷺ and companions.",
          "He declared his shahadah, and the house erupted in takbir."
        ]
      },
      {
        "isBullets": false,
        "heading": "A New Strength for Islam",
        "paragraphs": [
          "With Umar’s Islam, Muslims marched to the Ka‘bah in rows and prayed openly for the first time.",
          "The Prophet ﷺ’s dua for strengthening Islam through Umar was fulfilled."
        ]
      },
      {
        "isBullets": true,
        "heading": "Lessons from the Story",
        "paragraphs": [
          "Guidance is in Allah’s Hands — hearts can change instantly by His will.",
          "The Qur’an’s Power — Allah’s words transform even the hardest hearts.",
          "Faith and Courage — one believer’s conviction can uplift a community."
        ]
      },
      {
        "isBullets": false,
        "heading": "Legacy",
        "paragraphs": [
          "Umar (RA) became one of Islam’s greatest supporters, and his conversion marked a visible shift from secrecy to public practice."
        ]
      }
    ]
  },
  {
    "title": "Praying Openly in the Ka‘bah",
    "subtitle": "When Umar (RA) Made Islam Public",
    "intro": "After embracing Islam, Umar (RA) urged the Muslims to stop hiding and worship openly. With the Prophet’s ﷺ approval, they marched to the Ka‘bah and prayed before Quraysh, making Islam public in Makkah.",
    "sections": [
      {
        "isBullets": false,
        "heading": "Fear Before Umar’s Conversion",
        "paragraphs": [
          "Early Muslims worshipped secretly to avoid persecution and mockery.",
          "They lacked the strength to pray at the Ka‘bah openly."
        ]
      },
      {
        "isBullets": false,
        "heading": "Umar’s Bold Declaration",
        "paragraphs": [
          "Umar (RA) asked the Prophet ﷺ if they were upon truth in life and death; upon affirmation, he said they should no longer hide."
        ]
      },
      {
        "isBullets": false,
        "heading": "March to the Ka‘bah",
        "paragraphs": [
          "Two rows formed—one led by Hamzah (RA), the other by Umar (RA).",
          "They marched with resolve to the Ka‘bah while Quraysh looked on."
        ]
      },
      {
        "isBullets": false,
        "heading": "The First Open Prayer",
        "paragraphs": [
          "Muslims prayed openly, their recitation echoing through the sanctuary.",
          "Quraysh dared not intervene."
        ]
      },
      {
        "isBullets": false,
        "heading": "The Prophet’s ﷺ Dua Fulfilled",
        "paragraphs": [
          "The Prophet ﷺ had prayed for Islam to be strengthened through either Umar or Abu Jahl.",
          "Allah chose Umar (RA), and Islam gained new confidence."
        ]
      },
      {
        "isBullets": true,
        "heading": "Lessons from the Story",
        "paragraphs": [
          "Faith in Action — belief expresses itself in public worship when the time is right.",
          "Strength for the Ummah — individual courage can uplift many.",
          "Leadership — true leadership emboldens people to live their faith."
        ]
      },
      {
        "isBullets": false,
        "heading": "Legacy",
        "paragraphs": [
          "Umar’s resolve shifted Islam in Makkah from secrecy to public witness."
        ]
      }
    ]
  },
  {
    "title": "The Poor Woman and the Sack of Flour",
    "subtitle": "The Caliph Who Carried Food on His Own Back",
    "intro": "During a night patrol, Umar (RA) found a hungry family. He personally carried provisions on his back, cooked for the children, and refused recognition—seeking only Allah’s pleasure and fearing accountability.",
    "sections": [
      {
        "isBullets": false,
        "heading": "Umar’s Night Patrols",
        "paragraphs": [
          "Umar (RA) often walked Madinah at night in disguise to check on people.",
          "He discovered a tent where a mother tried to soothe her hungry children with a pot of boiling water."
        ]
      },
      {
        "isBullets": false,
        "heading": "A Mother’s Pain",
        "paragraphs": [
          "Unaware of the Caliph’s identity, she lamented her children’s hunger and invoked Allah’s justice between her and Umar."
        ]
      },
      {
        "isBullets": false,
        "heading": "Carrying the Burden Himself",
        "paragraphs": [
          "Umar (RA) fetched flour, dates, and fat from the treasury and refused his servant’s offer to carry the load.",
          "He said he must carry his burden himself before Allah."
        ]
      },
      {
        "isBullets": false,
        "heading": "Cooking for the Children",
        "paragraphs": [
          "He lit the fire, cooked the food, and fed the children with his own hands until they laughed with joy.",
          "He kept his identity hidden."
        ]
      },
      {
        "isBullets": true,
        "heading": "Lessons from the Story",
        "paragraphs": [
          "Leadership as Responsibility — not privilege.",
          "Humility in Power — serve with your own hands.",
          "Empathy in Action — help personally, not only by orders.",
          "Fear of Allah — accountability for every hungry soul."
        ]
      },
      {
        "isBullets": false,
        "heading": "Legacy",
        "paragraphs": [
          "A timeless example of justice and service that defines righteous leadership."
        ]
      }
    ]
  },
  {
    "title": "Umar’s Night Patrols",
    "subtitle": "The Caliph Who Walked the Streets in Secret",
    "intro": "Umar (RA) inspected his city at night to witness people’s conditions firsthand. From aiding births to cooking for the needy, he modeled personal responsibility and humility in governance.",
    "sections": [
      {
        "isBullets": false,
        "heading": "The Ruler of a Vast Empire",
        "paragraphs": [
          "Despite ruling expansive lands, Umar (RA) lived simply and sought truth directly, not relying solely on reports."
        ]
      },
      {
        "isBullets": false,
        "heading": "The Secret Walks",
        "paragraphs": [
          "Disguised with his servant Aslam, he walked to ensure no one suffered unseen."
        ]
      },
      {
        "isBullets": false,
        "heading": "Umar’s Immediate Response",
        "paragraphs": [
          "He and his wife aided a woman in labor; he prepared food while she helped inside.",
          "The father realized the helper was the Caliph himself."
        ]
      },
      {
        "isBullets": false,
        "heading": "Other Encounters",
        "paragraphs": [
          "These patrols revealed hungry families and unattended children. Umar (RA) consistently carried food and cooked for them.",
          "He feared even a mule stumbling in Iraq would be his responsibility before Allah."
        ]
      },
      {
        "isBullets": true,
        "heading": "Lessons from the Story",
        "paragraphs": [
          "Leadership is Service.",
          "Humility — never above serving people.",
          "Accountability to Allah — the core of governance.",
          "Family Support in Service."
        ]
      },
      {
        "isBullets": false,
        "heading": "Legacy",
        "paragraphs": [
          "A gold standard of compassionate leadership anchored in sincerity."
        ]
      }
    ]
  },
  {
    "title": "The Woman Who Challenged Umar (RA)",
    "subtitle": "When the Caliph Admitted a Woman Was Right",
    "intro": "When Umar (RA) advised limiting dowries, a woman cited Qur’an 4:20 in public. Umar (RA) immediately accepted correction, placing revelation above his own judgment.",
    "sections": [
      {
        "isBullets": false,
        "heading": "A Leader Who Spoke Plainly",
        "paragraphs": [
          "Umar (RA) addressed rising dowry amounts and advised moderation."
        ]
      },
      {
        "isBullets": false,
        "heading": "A Voice from the Crowd",
        "paragraphs": [
          "A woman stood and quoted the Qur’an allowing a heap of gold as dowry.",
          "Her point: no one can forbid what Allah has permitted."
        ]
      },
      {
        "isBullets": false,
        "heading": "Umar’s Humble Response",
        "paragraphs": [
          "He publicly admitted, “The woman is right, and Umar is wrong,” and corrected himself."
        ]
      },
      {
        "isBullets": true,
        "heading": "Lessons from the Story",
        "paragraphs": [
          "Accountability in Leadership — open to correction.",
          "Humility — greatness in admitting mistakes.",
          "Empowerment — women can question and correct leaders.",
          "Qur’an Above All — the final authority."
        ]
      },
      {
        "isBullets": false,
        "heading": "Legacy",
        "paragraphs": [
          "A celebrated example of justice: truth over pride, revelation over rank."
        ]
      }
    ]
  },
  {
    "title": "The Simplicity of Hazrat Umar (RA)",
    "subtitle": "The Caliph Who Lived Like the Poorest of His People",
    "intro": "Despite ruling a vast empire, Umar (RA) lived with minimal possessions, slept without guards, and refused privileges—anchoring leadership in justice and detachment from worldly luxury.",
    "sections": [
      {
        "isBullets": false,
        "heading": "The Ruler of a Vast Empire",
        "paragraphs": [
          "As lands and wealth flowed into Madinah, Umar (RA) chose a humble life—patched clothes and plain food."
        ]
      },
      {
        "isBullets": false,
        "heading": "Foreign Envoys in Shock",
        "paragraphs": [
          "Envoys found him resting under a tree without guards. He said justice removes the need for fear."
        ]
      },
      {
        "isBullets": false,
        "heading": "His Famous Statement",
        "paragraphs": [
          "He likened himself to a traveler resting briefly under a tree before moving on."
        ]
      },
      {
        "isBullets": false,
        "heading": "Refusing Privileges",
        "paragraphs": [
          "He took only a modest allowance and prioritized the poor, needy, and orphans."
        ]
      },
      {
        "isBullets": true,
        "heading": "Lessons from the Story",
        "paragraphs": [
          "Power with Humility.",
          "Justice Brings Peace.",
          "Detachment from Dunya.",
          "Leadership by Example."
        ]
      },
      {
        "isBullets": false,
        "heading": "Legacy",
        "paragraphs": [
          "His simplicity stunned kings and inspired generations; worth lies in service and accountability."
        ]
      }
    ]
  },
  {
    "title": "The Conquest of Jerusalem",
    "subtitle": "When Umar (RA) Entered the Holy City with Humility",
    "intro": "After Jerusalem’s surrender on condition that the Caliph receive it, Umar (RA) arrived with one servant and a single camel, entering humbly and guaranteeing protection for the people and their churches.",
    "sections": [
      {
        "isBullets": false,
        "heading": "The Siege of Jerusalem",
        "paragraphs": [
          "Muslim armies surrounded the city; the Patriarch agreed to surrender only to the Caliph himself."
        ]
      },
      {
        "isBullets": false,
        "heading": "The Simplicity of the Journey",
        "paragraphs": [
          "Umar (RA) and his servant alternated riding; he entered walking when it was the servant’s turn.",
          "He affirmed that honor comes from Islam, not status."
        ]
      },
      {
        "isBullets": false,
        "heading": "The Meeting with the Patriarch",
        "paragraphs": [
          "Keys were handed to Umar (RA), who displayed humility and fairness.",
          "He prayed outside the Church of the Holy Sepulchre to avoid future claims on it."
        ]
      },
      {
        "isBullets": false,
        "heading": "The Covenant of Umar",
        "paragraphs": [
          "He guaranteed safety for lives and property, protection for churches and crosses, and freedom of worship."
        ]
      },
      {
        "isBullets": true,
        "heading": "Lessons from the Story",
        "paragraphs": [
          "Humility in Victory.",
          "Justice for All, including other faiths.",
          "Equality — no superiority except in piety.",
          "Legacy of Peace — tolerance and protection."
        ]
      },
      {
        "isBullets": false,
        "heading": "Legacy",
        "paragraphs": [
          "A bloodless transition marked by justice and compassion."
        ]
      }
    ]
  },
  {
    "title": "Umar’s Letter to the Nile",
    "subtitle": "When the River Obeyed the Command of Allah",
    "intro": "Facing drought and pagan superstition in Egypt, Umar (RA) wrote a letter addressed to the Nile, affirming Allah’s power. The river rose, ending the crisis and strengthening tawheed among the people.",
    "sections": [
      {
        "isBullets": false,
        "heading": "The Drought in Egypt",
        "paragraphs": [
          "Egyptians feared the Nile would not flow without a sacrificial ritual, a practice Islam rejected."
        ]
      },
      {
        "isBullets": false,
        "heading": "The Governor’s Letter",
        "paragraphs": [
          "Amr ibn al-As (RA) wrote to Umar (RA) explaining the situation and fears."
        ]
      },
      {
        "isBullets": false,
        "heading": "The Letter of Umar (RA)",
        "paragraphs": [
          "Umar (RA) wrote to the Nile: if it flowed by its own will, it should stop; if by Allah’s will, they asked Allah to make it flow."
        ]
      },
      {
        "isBullets": false,
        "heading": "The Miracle of the Nile",
        "paragraphs": [
          "The letter was cast into the river; by morning, water levels rose abundantly and the drought ended."
        ]
      },
      {
        "isBullets": true,
        "heading": "Lessons from the Story",
        "paragraphs": [
          "Tawheed — nothing has power except by Allah.",
          "Faith in Action — no compromise with superstition.",
          "Wise Leadership — solving crises while strengthening belief.",
          "Allah’s Power Over Nature."
        ]
      },
      {
        "isBullets": false,
        "heading": "Legacy",
        "paragraphs": [
          "The story broke superstition and affirmed that a ruler’s greatest strength is faith."
        ]
      }
    ]
  },
  {
    "title": "Umar’s Justice with the Coptic Christian",
    "subtitle": "When the Son of a Governor Was Punished for Oppression",
    "intro": "A Coptic Christian was whipped by a governor’s son after defeating him in a race. Umar (RA) summoned them to Madinah and let the victim take equal retaliation—then declared that all people are born free.",
    "sections": [
      {
        "isBullets": false,
        "heading": "The Incident in Egypt",
        "paragraphs": [
          "After losing a race, the governor’s son struck a Coptic Christian and boasted of his status."
        ]
      },
      {
        "isBullets": false,
        "heading": "The Coptic Man in Madinah",
        "paragraphs": [
          "The victim sought justice from Umar (RA), who summoned the governor and his son."
        ]
      },
      {
        "isBullets": false,
        "heading": "Justice in Public",
        "paragraphs": [
          "Umar (RA) handed the whip to the victim and allowed equal retaliation, upholding justice publicly."
        ]
      },
      {
        "isBullets": false,
        "heading": "Umar’s Famous Words",
        "paragraphs": [
          "He declared: “Since when have you enslaved people, when their mothers bore them free?”"
        ]
      },
      {
        "isBullets": true,
        "heading": "Lessons from the Story",
        "paragraphs": [
          "Justice Without Bias.",
          "Equality Before Law.",
          "Fearless Leadership.",
          "Human Dignity as a right from Allah."
        ]
      },
      {
        "isBullets": false,
        "heading": "Legacy",
        "paragraphs": [
          "A defining example of Islamic justice admired even beyond the Muslim world."
        ]
      }
    ]
  },
  {
    "title": "The Martyrdom of Hazrat Umar (RA)",
    "subtitle": "The Caliph Who Left the World in Prayer",
    "intro": "Umar (RA) was stabbed while leading Fajr in Madinah. In his final moments he prioritized the Ummah’s prayer, sought to ensure just succession, and asked to be buried beside the Prophet ﷺ and Abu Bakr (RA).",
    "sections": [
      {
        "isBullets": false,
        "heading": "The Fajr Prayer",
        "paragraphs": [
          "In 644 CE during Dhul-Hijjah, Umar (RA) led Fajr as Muslims stood in rows behind him."
        ]
      },
      {
        "isBullets": false,
        "heading": "The Stabbing",
        "paragraphs": [
          "A man attacked with a double-bladed dagger. Umar (RA) instructed Abdur Rahman ibn Awf (RA) to continue leading the prayer."
        ]
      },
      {
        "isBullets": false,
        "heading": "Umar’s Final Concerns",
        "paragraphs": [
          "He asked whether his killer was Muslim and kept asking if anyone had a claim against him, fearing injustice on his record."
        ]
      },
      {
        "isBullets": false,
        "heading": "The Succession",
        "paragraphs": [
          "He appointed a council of six companions to choose the next Caliph to protect unity."
        ]
      },
      {
        "isBullets": false,
        "heading": "The Burial Request",
        "paragraphs": [
          "He requested permission from Aisha (RA) to be buried beside the Prophet ﷺ and Abu Bakr (RA), which she granted."
        ]
      },
      {
        "isBullets": false,
        "heading": "The End of a Giant",
        "paragraphs": [
          "He passed at age 63 and was buried next to the Prophet ﷺ and Abu Bakr (RA)."
        ]
      },
      {
        "isBullets": true,
        "heading": "Lessons from the Story",
        "paragraphs": [
          "Faith to the End — he died in prayer.",
          "Accountability — concern over any injustice.",
          "Unity Over Division — ensured a just succession.",
          "Humility — requested a simple resting place near his Prophet ﷺ."
        ]
      },
      {
        "isBullets": false,
        "heading": "Legacy",
        "paragraphs": [
          "His martyrdom closed an era of justice and humility that remains a model for leadership."
        ]
      }
    ]
  }
]
