Repository: Ardaolmez/deen-buddy
Catalog: Deen Buddy Advanced/*.lproj/Prayers.strings
Languages: tr

# navigationTitle
source: Prayers
tr: Namaz Saatleri

source: My Prayers
tr: Namaz Saatlerim

source: Today's Prayers
tr: Bugünün Namazları

source: Did you pray %@?
tr: %@ namazını kıldınız mı?

source: Great job!
tr: Harika!

# markedCompleted
source: Marked as completed for today.
tr: Bugün için tamamlandı olarak işaretlendi.

# markCompleted
source: Mark it completed to track your consistency.
tr: Tutarlılığınızı takip etmek için tamamlandı olarak işaretleyin.

source: current
tr: Şimdi

source: Now
tr: Şimdi

source: Next
tr: Sonraki

# nextPrayer
source: Upcoming
tr: Yaklaşan

# nextPrayerAt
source: Next: %@ at %@
tr: Sonraki: %@ saat %@

# nextPrayerTomorrow
source: Next: %@ tomorrow
tr: Sonraki: Yarın %@

source: Before Fajr
tr: İmsak Öncesi

source: Sunrise
tr: Güneşin Doğuşu

source: Sunset
tr: Güneşin Batışı

source: Zawal
tr: İstiva

source: Undo
tr: Geri Al

source: Yes
tr: Evet

# history
source: Stats
tr: İstatistikler

# prayerStreakTitle
source: Weekly Streak
tr: Haftalık Seri

# streakPerfect
source: Perfect so far — keep it up!
tr: Şu ana kadar mükemmel — devam et!

# streakSoFarFormat
source: Streaks this month: %@
tr: Bu ayki seriler: %@

# availableLater
source: Available when time comes
tr: Vakti geldiğinde kullanılabilir

source: All Complete
tr: Hepsi Tamamlandı

source: Perfect!
tr: Mükemmel!

# nextDhuhrCompact
source: Next: %@ — %@
tr: Sonraki: %@ — %@

# nowPrayerCompact
source: Now: %@ — %@
tr: Şimdi: %@ — %@

source: Fajr
tr: Sabah

source: Dhuhr
tr: Öğle

source: Asr
tr: İkindi

source: Maghrib
tr: Akşam

source: Isha
tr: Yatsı

# fajrShort
source: Fajr
tr: Sabah

# dhuhrShort
source: Dhuhr
tr: Öğle

# asrShort
source: Asr
tr: İkindi

# maghribShort
source: Magh
tr: Akşam

# ishaShort
source: Isha
tr: Yatsı

source: Locating…
tr: Konum bulunuyor…

source: Your Area
tr: Bölgeniz

source: Qibla Direction
tr: Kıble Yönü

# alignedToQibla
source: Face to Qibla
tr: Kıbleye Dön

# turnDirectionFormat
source: Turn %@ %d°
tr: %@ %d° dön

source: Left
tr: Sola

source: Right
tr: Sağa

source: Device
tr: Cihaz

source: Current Heading
tr: Mevcut Yön

source: Difference
tr: Fark

source: Getting location...
tr: Konum alınıyor...

# lowAccuracyWarning
source: Low compass accuracy - calibrate your device
tr: Düşük pusula hassasiyeti - cihazınızı kalibre edin

# madhabShafi
source: Shafi'i
tr: Şafii

# madhabHanafi
source: Hanafi
tr: Hanefi

# madhabShafiDesc
source: Standard (Shafi'i, Maliki, Hanbali)
tr: Standart (Şafii, Maliki, Hanbeli)

# madhabHanafiDesc
source: Later Asr time (Hanafi)
tr: Geç İkindi vakti (Hanefi)
