Repository: Ardaolmez/deen-buddy
Catalog: Deen Buddy Advanced/*.lproj/Today.strings
Languages: tr

# navigationTitle
source: Today's Reflection
tr: Günün Yolculuğu

# selfLearningTitle
source: Today's Learning
tr: Günün Öğrenimi

source: Daily Quiz
tr: Günlük Test

# startLesson
source: Start
tr: Başla

# continueJourney
source: Continue your journey with tailored lessons
tr: Özel derslerle yolculuğunuza devam edin

# dailyVerseTitle
source: Daily Verse
tr: Günün Ayeti

# dailyQuranGoal
source: Daily Quran:
tr: Günlük Kuran:

source: verses
tr: ayetler

source: minutes
tr: dakika

source: pages
tr: sayfalar

# versesAhead
source: %d verses ahead
tr: %d ayet ilerde

# versesBehind
source: %d verses behind
tr: %d ayet geride

# minutesAhead
source: %d minutes ahead
tr: %d dakika ilerde

# minutesBehind
source: %d minutes behind
tr: %d dakika geride

source: On track
tr: Hedefte

# versesToGo
source: %d verses to go
tr: %d ayet kaldı

# minutesToGo
source: %d minutes to go
tr: %d dakika kaldı

source: Read
tr: Oku

source: Listen
tr: Dinle

source: Tap for details
tr: Detaylar için dokun

source: Tap to collapse
tr: Kapatmak için dokun

source: Today's Progress
tr: Günlük İlerleme

source: Goal
tr: Hedef

source: Completed
tr: Tamamlanan

source: Remaining
tr: Kalan

source: Timeline
tr: Zaman Çizelgesi

source: Expected
tr: Beklenen

source: Actual
tr: Gerçekleşen

source: Status
tr: Durum

source: Streak
tr: Seri

source: Current
tr: Şu anki

source: Best
tr: En İyi

source: days
tr: günler

source: day
tr: gün

source: Select Your Goal
tr: Hedefinizi Seçin

source: Completion Goals
tr: Günlük Hedefler

source: Micro-Learning Goals
tr: Mikro Öğrenme Hedefler

source: Start Goal
tr: Hedefe Başla

source: Cancel
tr: İptal

# versePrefix
source: Verse
tr: Ayet

source: Could not load Quran data
tr: Kuran verileri yüklenemedi

source: Could not select daily verse
tr: Günlük ayet seçilemedi

source: Tap to read full
tr: Tamamını okumak için dokun

# feedbackThankYou
source: Thank you for your feedback!
tr: Geri bildiriminiz için teşekkürler!

# feedbackError
source: Failed to submit feedback. Please try again.
tr: Geri bildirim gönderilemedi. Lütfen tekrar deneyin.

source: Progress today
tr: Günlük ilerleme

# dailyStreakTitle
source: Daily Streak
tr: Günlük Seri

# currentStreak
source: Current
tr: Şu anki

# bestStreakLabel
source: Best
tr: En İyi

# dayStreak
source: %d day
tr: %d gün

# daysStreak
source: %d days
tr: %d gün

# dailyVerseActivity
source: Daily Verse
tr: Günün Ayeti

# dailyDuroodActivity
source: Daily Durood
tr: Günün Salavatı

# dailyDuaActivity
source: Daily Dua
tr: Günün Duası

# dailyWisdomActivity
source: Daily Wisdom
tr: Günün Hikmeti

# estimatedTime
source: %d MIN
tr: %d DAK

# learnSomethingNew
source: Learn something new every day
tr: Her gün yeni bir şey öğren!

# activityDone
source: DONE
tr: TAMAMLANDI

source: Mark Complete
tr: Tamamlandı Olarak İşaretle

# listenLabel
source: Listen
tr: Dinle

# readLabel
source: Read
tr: Oku

# closeLabel
source: Close
tr: Kapat

# dailyQuizLabel
source: Daily Quiz: 5 questions
tr: Günlük Test: 5 soru

# dailyQuizMinutes
source: 5 MIN
tr: 5 DAK

# dailyQuizStart
source: Start
tr: Başla

# dailyQuizContinue
source: Continue
tr: Devam Et

# dailyQuizReview
source: Review
tr: Cevapları Incele

# dailyQuizSubmit
source: Submit
tr: Gönder

# activityProgressToday
source: Progress today
tr: Günlük ilerleme

# activityTranslationLabel
source: Translation
tr: Çeviri

# activityExplanationLabel
source: Explanation
tr: Açıklama

# activityChatToLearnMore
source: Chat to learn more
tr: Iman Buddy'e sor

# activityTodaysJourney
source: Today's Journey
tr: Günün Yolculuğu

# wisdomUnderstanding
source: Understanding
tr: Anlayış

# wisdomChatPromptPrefix
source: I would like to learn more about this wisdom quote by
tr: Bu hikmet sözü hakkında daha fazla bilgi edinmek istiyorum

# wisdomChatQuoteLabel
source: Quote:
tr: Alıntı:

# wisdomChatExplanationLabel
source: The explanation given is:
tr: Verilen açıklama:

# wisdomChatRequestDetails
source: Please tell me more about: • The deeper meaning and context of this wisdom • How to apply this in daily life • Related teachings from Islam • Practical examples of living by this principle
tr: Lütfen bana şunlar hakkında daha fazla bilgi verin: • Bu hikmetin derin anlamı ve bağlamı • Günlük hayatta nasıl uygulanır • İslam'dan ilgili öğretiler • Bu ilkeye göre yaşamanın pratik örnekleri

# wisdomShareTitle
source: Word of Wisdom
tr: Hikmet Sözü

# wisdomShareFooter
source: Shared from Iman Buddy
tr: Iman Buddy'den paylaşıldı

# streakDayLabel
source: day streak
tr: günlük seri

# streakEncouragement
source: Come back tomorrow to keep your streak going and get closer to God
tr: Serinizi sürdürmek için yarın geri gelin ve Allah'a daha da yaklaşın

# streakDoneButton
source: Done
tr: Tamam

# lockedNotQuiteTime
source: Not quite time yet.
tr: Henüz tam zamanı değil.

# lockedCheckBackOn
source: Check back on %@ for your Daily Plan session
tr: Günlük Plan oturumunuz için %@ tarihinde tekrar kontrol edin

# lockedDontMissDay
source: Don't miss a day
tr: Bir gün kaçırmayın

# lockedSetReminder
source: Set a reminder
tr: Hatırlatıcı ayarla

# journeyTodayTitle
source: Today's Journey
tr: Bugünün Yolculuğu

# journeyDateSuffix
source: 's Journey
tr: 'nın Yolculuğu

# activityDoneLabel
source: DONE
tr: TAMAMLANDI

# activityListenButton
source: Listen
tr: Dinle

# activityReadButton
source: Read
tr: Oku

# feedbackTitle
source: Feedback
tr: Geri Bildirim

# feedbackHeaderTitle
source: We'd love to hear from you!
tr: Sizden haber almak isteriz!

# feedbackHeaderSubtitle
source: Share your suggestions, ideas, or feedback to help us improve the app.
tr: Uygulamayı geliştirmemize yardımcı olmak için önerilerinizi, fikirlerinizi veya geri bildirimlerinizi paylaşın.

# feedbackPlaceholder
source: Type your suggestion here...
tr: Önerinizi buraya yazın...

# feedbackSubmitButton
source: Submit Feedback
tr: Geri Bildirim Gönder

# feedbackCancelButton
source: Cancel
tr: İptal

# feedbackNetworkError
source: Network error. Please check your connection.
tr: Ağ hatası. Lütfen bağlantınızı kontrol edin.

# feedbackDataError
source: Failed to prepare feedback data
tr: Geri bildirim verilerini hazırlama başarısız

# feedbackServerError
source: Server error. Please try again later.
tr: Sunucu hatası. Lütfen daha sonra tekrar deneyin.

# trackingSaveButton
source: Save
tr: Kaydet

# weeklyStreakProgressFor
source: Progress for %@
tr: %@ için ilerleme
